//#include<stdio.h>

//int main()
//{
//	int d = -0b110010;  //换算成十进制为 -50
//	printf("十进制：d=%d\n", d);
//
//	int e = -0101; //八进制负数，换算成十进制为 -65
//	printf("十进制：d=%d\n", e);
//	printf("八进制：d=%#o\n", e); // 输出值与所赋初值不一致，说明一个负数在定义和赋初值的时候可以用八进制表示，但是不可以用八进制格式输出该负数
//
//	int f = -0XA0; //十六进制负数，换算成十进制为 -160
//	printf("十进制：e=%d\n", f);
//	printf("十六大：e=%#X\n", f); // 输出值与所赋初值不一致，说明一个负数在定义和赋初值的时候可以用十六进制表示，但是不可以用十六进制格式输出该负数
//
//	puts("\n");
//  
//  return 0;
//}

//int main()
//{
//	//有符号数
//	short a = 0100; //八进制
//	int b = -0x1; //十六进制
//	long c = 720; //十进制
//
//	//无符号数
//	unsigned short m = 0xffff; //十六进制
//	unsigned int n = 0x80000000; //十六进制
//	unsigned long p = 100; //十进制
//
//	//以无符号的形式输出有符号数
//	printf("a=%#ho, b=%#x, c=%lu\n", a, b, c);
//
//	//以有符号的形式输出无符号数(只能以十进制形式输出)
//	printf("m=%hd, n=%d, p=%ld\n", m, n, p);
//
//	return 0;
//}